Revit 2026 API

# EventStatus Enumeration

---

Describes the status of an action which triggered a post event.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum EventStatus
```
```vb
Public Enumeration EventStatus
```
```cpp
public enum class EventStatus
```
```fsharp
type EventStatus
```

| Member name | Value | Description |
| --- | --- | --- |
| Cancelled | 1 | The action that triggered this event was cancelled by an event handler from the pre-event for the action. |
| Failed | -1 | The action that triggered this event failed. |
| Succeeded | 0 | The action that triggered this event succeeded. |

#### Reference

Autodesk.Revit.DB.Events Namespace